## 데이터의 그룹화

#### 데이터 불러오기

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### groupby()
- class_group = groupby() : **'열'**의 이름으로 그룹화 (**변수에 담아주기!**)  
> 데이터 담은 변수(class_group)를 출력해봐도 객체 정보만 출력됨. 따라서 아래의 **groups** 속성으로 확인해주어야 함!  
- **groups** 속성: 각 그룹과 그룹에 속한 index를 dict 형태로 표현 (**변수(객체) 내용 보기**)  
> 키 : 그룹(클래스) , 값 : 해당 그룹에 속한 **행** 번호

In [3]:
class_group = df.groupby('Pclass') # groupby('열 이름') : Pclass를 그룹화
class_group

In [4]:
class_group.groups  # 그룹의 정보 확인, 키는 그룹, 데이터는 해당 그룹에 속한 '행'번호
# {1 : ~, 2 : ~} 이렇게 Pclass(n등석)의 값을 키로 해서 그룹핑

{1: Int64Index([  1,   3,   6,  11,  23,  27,  30,  31,  34,  35,
             ...
             853, 856, 857, 862, 867, 871, 872, 879, 887, 889],
            dtype='int64', length=216),
 2: Int64Index([  9,  15,  17,  20,  21,  33,  41,  43,  53,  56,
             ...
             848, 854, 861, 864, 865, 866, 874, 880, 883, 886],
            dtype='int64', length=184),
 3: Int64Index([  0,   2,   4,   5,   7,   8,  10,  12,  13,  14,
             ...
             875, 876, 877, 878, 881, 882, 884, 885, 888, 890],
            dtype='int64', length=491)}

In [6]:
gender_group = df.groupby('Sex') # 성별로 그룹화
gender_group.groups # 그룹의 정보 확인 (groups 속성)

{'female': Int64Index([  1,   2,   3,   8,   9,  10,  11,  14,  15,  18,
             ...
             866, 871, 874, 875, 879, 880, 882, 885, 887, 888],
            dtype='int64', length=314),
 'male': Int64Index([  0,   4,   5,   6,   7,  12,  13,  16,  17,  20,
             ...
             873, 876, 877, 878, 881, 883, 884, 886, 889, 890],
            dtype='int64', length=577)}

#### groupping 함수
**그룹 데이터**에 적용 가능한 **통계 함수(NaN은 제외하여 연산)**
> 각 **열 별로** 통계 계산  
  
 - count() : 데이터 개수 
 - sum() : 데이터의 합
 - mean(), std(), var() : 평균, 표준편차, 분산

In [7]:
class_group.count() # Pclass를 기준으로 각 등급별로 모든 열들에 속하는 데이터 총 개수

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [8]:
class_group.sum()

        PassengerId  Survived      Age  SibSp  Parch        Fare
Pclass
1             99705       136  7111.42     90     77  18177.4125
2             82056        87  5168.83     74     70   3801.8417
3            215625       119  8924.92    302    193   6714.6951

In [9]:
class_group.mean()

        PassengerId  Survived        Age     SibSp     Parch       Fare
Pclass
1        461.597222  0.629630  38.233441  0.416667  0.356481  84.154687
2        445.956522  0.472826  29.877630  0.402174  0.380435  20.662183
3        439.154786  0.242363  25.140620  0.615071  0.393075  13.675550

In [10]:
class_group.mean()['Survived'] # 그룹별로 평균값들 구해서 그 중 Survived 열만 보기

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

#### cf. 성별에 따른 생존율 구해보기

In [11]:
df.head()    #위에서 read_csv()함수로 가져온 데이터 프레임

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
df.mean() # 각 열마다 평균 구하기 (Series)

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [13]:
df.groupby('Sex').mean() # 성별로 각 행들을 그룹화 한 후, 그룹 마다 평균 구하기

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [14]:
df.groupby('Sex').mean()['Survived'] # 모든 열 평균들 중 Survived 열의 그룹별 평균만!

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

### 복수 columns로 groupping 하기
- groupby에 column 리스트를 전달 (groupby([ '열 이름1', '열 이름2'  ]))  
> **튜플** 형태로 그룹화!
- 통계함수를 적용한 결과는 multiindex를 갖는 dataframe

#### cf. 클래스와 성별에 따른 생존률 구해보기

In [16]:
cg_group = df.groupby(['Pclass', 'Sex']) # 클래스와 성별으로 그룹화
cg_group

In [17]:
cg_group.groups

{(1,
  'female'): Int64Index([  1,   3,  11,  31,  52,  61,  88, 136, 151, 166, 177, 194, 195,
             215, 218, 230, 256, 257, 258, 268, 269, 275, 290, 291, 297, 299,
             306, 307, 309, 310, 311, 318, 319, 325, 329, 334, 337, 341, 356,
             366, 369, 375, 380, 383, 393, 412, 435, 457, 486, 496, 498, 504,
             513, 520, 523, 537, 539, 540, 556, 558, 571, 577, 581, 585, 591,
             609, 627, 641, 669, 689, 700, 708, 710, 716, 730, 742, 759, 763,
             765, 779, 781, 796, 809, 820, 829, 835, 842, 849, 853, 856, 862,
             871, 879, 887],
            dtype='int64'),
 (1, 'male'): Int64Index([  6,  23,  27,  30,  34,  35,  54,  55,  62,  64,
             ...
             793, 802, 806, 815, 822, 839, 857, 867, 872, 889],
            dtype='int64', length=122),
 (2,
  'female'): Int64Index([  9,  15,  41,  43,  53,  56,  58,  66,  84,  98, 123, 133, 161,
             190, 199, 211, 237, 247, 259, 272, 303, 312, 316, 322, 323, 327,
             345, 346, 357, 387, 389, 399, 416, 417, 426, 427, 432, 437, 440,
             443, 446, 458, 472, 473, 506, 516, 518, 526, 530, 535, 546, 576,
             580, 596, 600, 608, 615, 618, 635, 651, 670, 706, 717, 720, 726,
             747, 750, 754, 772, 774, 801, 854, 865, 866, 874, 880],
            dtype='int64'),
 (2, 'male'): Int64Index([ 17,  20,  21,  33,  70,  72,  78,  99, 117, 120,
             ...
             812, 817, 827, 831, 841, 848, 861, 864, 883, 886],
            dtype='int64', length=108),
 (3, 'female'): Int64Index([  2,   8,  10,  14,  18,  19,  22,  24,  25,  28,
             ...
             823, 830, 852, 855, 858, 863, 875, 882, 885, 888],
            dtype='int64', length=144),
 (3, 'male'): Int64Index([  0,   4,   5,   7,  12,  13,  16,  26,  29,  36,
             ...
             868, 869, 870, 873, 876, 877, 878, 881, 884, 890],
            dtype='int64', length=347)}

In [18]:
cg_group = df.groupby(['Pclass', 'Sex']).mean() # 여러열로 그룹화 후 각 열마다 평균!
cg_group

               PassengerId  Survived        Age     SibSp     Parch  \
Pclass Sex
1      female   469.212766  0.968085  34.611765  0.553191  0.457447
       male     455.729508  0.368852  41.281386  0.311475  0.278689
2      female   443.105263  0.921053  28.722973  0.486842  0.605263
       male     447.962963  0.157407  30.740707  0.342593  0.222222
3      female   399.729167  0.500000  21.750000  0.895833  0.798611
       male     455.515850  0.135447  26.507589  0.498559  0.224784

                     Fare
Pclass Sex
1      female  106.125798
       male     67.226127
2      female   21.970121
       male     19.741782
3      female   16.118810
       male     12.661633

In [19]:
cg_group.index # 위의 그룹화 결과의 인덱스 정보들 출력

# [(1, 'female'),
#  (1, 'male'),
#  (2, 'female'),
#  (2, 'male'),
#  (3, 'female'),
#  (3, 'male') ] 
# 이런식으로 출력됨! (multiIndex)

MultiIndex(levels=[[1, 2, 3], ['female', 'male']],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['Pclass', 'Sex'])

In [20]:
cg_group['Survived'] # 그룹화 결과의 평균값 데이터인 cg_group에서 Survived열만 가져옴

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

In [21]:
cg_group.loc[[(2, 'female')]] # cg_group 중에서 (2, female)행 가져오기 (dataframe)
# 2행 (2등석) : Pclass 행의 이름이 2! (female과 male 다 합친 것)
# multiIndex는 ***튜플*** 형식이므로, 행 이름에 (, ) 튜플 형식 인덱스로 넣어주기!

               PassengerId  Survived        Age     SibSp     Parch       Fare
Pclass Sex
2      female   443.105263  0.921053  28.722973  0.486842  0.605263  21.970121

<hr>

### index를 이용한 group by

* **set_index**()
 - column 데이터를 index 레벨로 변경
* **reset_index**()
 - 인덱스 초기화

In [ ]:
df.head()

In [ ]:
df.set_index('Pclass')

In [ ]:
df.set_index(['Pclass', 'Sex'])

In [ ]:
df.set_index(['Pclass', 'Sex']).reset_index()

In [ ]:
df.set_index('Age')

##### index를 이용한 group by

- index가 있는 경우, groupby 함수에 level 사용 가능
   - level은 index의 depth를 의미하며, 가장 왼쪽부터 0부터 증가

In [ ]:
df.head()

In [ ]:
df.set_index(['Pclass', 'Sex'])

In [ ]:
df.set_index(['Pclass', 'Sex']).groupby(level=0).mean()

In [ ]:
df.set_index(['Pclass', 'Sex']).groupby(level=[0,1]).mean()